[
    {
        "id": 0,
        "text": ""
    },
    {
        "id": 1,
        "text": "The students from various institutions have showcased remarkable achievements in both co-curricular and extra-curricular activities. In the academic year 2024-25, Kiran Patel, Tejaswiii Polcompally, Nithya Etoori, and Rishika Gudla participated in the Hack Conquest event organized by TKR College of Engineering and Technology and secured the 10th position as runners-up. In 2023-24, Morsu Greeshma, Pavithra Kumar Sahu, Yedavally Akshaya Samatham, and Leela Sudhrashan took part in the FinTech event organized by Gokaraju Rangaraju Institute of Engineering and Technology, where they won 1st place. Additionally, in the 2022-23 academic year, Ajith George, Sam Yogesh Kongara, Rahul Valavoju, Rithwik Marpally, and Kancharla Niteesh Reddy, representing IIIT Chittoor, excelled in the Smart India Hackathon, securing 1st prize. These accomplishments reflect the dedication and talent of the students in various competitive events."
    },
    {
        "id": 2,
        "text": "The following are some notable publications and projects in the field of CSE for the academic years 2023-24, 2022-23, 2021-22, 2020-21, 2019-20, 2018-19, 2017-18, 2016-17, and 2015-16. In 2024, Dr. J. Sreedhar published 'Recommendation of Electronic Mobile Gadgets Using Infused Decision Score with Mobile Radiation and Federated Sentiment Score' in IEEE (ISSN: 0098-3063). In the same year, Dr. Ajeet K. Jain authored 'Cognitive Horses of Deep Learning: Regularization and Optimization Practices' in BS Publications (ISBN: 978-93-950387-44). Dr. B. Kiranmai's 2023 paper in the 'Journal for Control, Measurement, Electronics, Computing, and Communications,' titled 'Energy Efficient Congestion Control Scheme Based on Modified Harris Hawks Optimization for Heavy Traffic Wireless Sensor Networks' (DOI: https://doi.org/10.1080/00051144.2023.2243143), focuses on optimizing congestion control. In 2023, Dr. M. Shailaja published 'CNN Algorithm for Breast Cancer Detection of Mammogram Images' in the Journal of Data Acquisition and Processing (ISSN: 1004-9037), while Dr. B. Kiranmai also published 'Comparative Analysis, Association, and Prediction of Various Phenotypic Traits of Oryza Sativa' in the International Journal of Agriculture and Biosciences (ISSN: 2772-83). In 2023, Dr. B. Kiranmai contributed another paper titled 'Face and Object Detection Algorithms for People Counting Applications' in IEEE (ISBN: 979-83-5034-0235). Dr. B. Kiranmai, along with Dr. B. Jyoshna, co-authored 'Abnormal Behavior Detection to Avoid Attacks in Cloud Based on Association Rules' in IEEE (ISBN: 979-83-5034-0235). Dr. Ajeet K. Jain published 'Implementing a Linear Regression Gradient Descent Model for Admission Process Framework' in the CVR Journal of Science and Technology (ISSN: 2277-3916). D. Champla published 'Energy Efficient Multihop Routing Scheme Using Taylor-Based Gravitational Search Algorithm in Wireless Sensor Networks' in Original Scientific Paper (ISSN: 333). Ms. Masarat Saba's paper, 'Enhancing Agile Development with Security Integration: Introducing the HSSCRUM Framework for Optimized and Secure Software Development,' was published in JATIT (ISSN: 1992-8645) in 2023. Dr. T. Sunil authored two papers in 2023: 'An Efficient Information Extraction Mechanism with Page Ranking and a Classification Strategy Based on Similarity Learning of Web Text Documents' in IJRITCC (ISSN: 2321-8169), and 'Exploring the Landscape of Sentiment Analysis and Opinion Mining' in Springer. Dr. T. Sunil also published 'Evaluating Security Risks and Protecting Conversational AI: An In-Depth Vulnerability Assessment and Security Testing of the ChatGPT Android Application' in Springer in 2023."
    },
    {
        "id": 3,
        "text": "Institution Innovation Council (IIC) IIC Committee IIC Events 21st Century Skills Workshop. 74% of tech companies plan to recruit college graduates to meet the engineering and information technology needs of the organization. Tech companies continue to rely on universities to build the most sought-after skills and the fresh perspective they bring to the workforce. The IIC aims at transforming the traditional methods of campus recruitment and internship models to meet the talent needs and devise an approach that provides exposure to applying technology to real-life problems. Functions include continuous education focusing on talent needs, long-term strategic alliances with a focus on nonlinear, recursive engagement, building talent to solve business problems, developing a talent pipeline that can hit the ground running, promoting academic entrepreneurship, being part of a social contract for sustained employment generation, enabling national goals for digitization and digital governance, deepening emerging tech capabilities, moving up the value chain, and shifting focus to innovation investment centers."
    },
    { 
         "id": 4,
        "text": "Tessellator is KMIT's Learning Management System. It is a customized version of Moodle, an open-source learning management system provided by Google. We at KMIT have customized it as per our needs and have been using it on multiple networks. It provides an option of two different modules. After each programming class, students are required to take a quiz, which is a collection of multiple-choice questions. Once they submit the quiz, they are presented with a form where they have guidelines to write a code program (e.g., Java, C) pertaining to the class held. There are usually three programs given to the students as part of the test. If the student is a slow learner, he or she might be able to work on a single program, while the fast learners may go to the third program. Google's platform, Moodle by itself, doesn't have the code compilation technique, but we at KMIT have extended its capabilities to suffice our needs and have added code compilation techniques for Java, C, and a few other programming languages."
    },
    {
        "id": 5,
        "text": "Regulations: The departments of KMIT are responsible for the academic activities, which include teaching, research, and industrial consultancy. The courses of study are organized on a semester basis, and the medium of instruction is English. Students are evaluated on a continuous basis each academic year, which consists of two semesters, with each semester providing a minimum of seventeen weeks of instruction. Evaluation comprises continuous internal evaluation (CIE) and semester-end examinations (SEE). The rigors of academic study at each level are balanced with a number of other related activities, which include co-curricular activities. Special lectures on varied topics of academic relevance are held under the Extra Mural Lecture Series. A number of conferences, symposia, and workshops are organized by the faculty, which attract participation from scholars from all corners of India and abroad. Guest lectures and industrial visits complement classroom interactions. The academic atmosphere at the institute is a rare blend of modern-day technical skills and the traditional emphasis on imparting knowledge. All the academic activities at the institute are monitored by the Dean of Academic Affairs and can be viewed through the academic calendar, timetables of individual programs, examination schedules, and the yearly college diary.

Academic Regulations of B.Tech Program:

B.Tech KR24 - Academic Regulations Autonomous KR24

B.Tech KR23 - Academic Regulations Autonomous KR23

B.Tech KR21 - Academic Regulations Autonomous KR21

B.Tech KR20 - Academic Regulations Autonomous KR20

B.Tech R18 - Academic Regulations R18

B.Tech R16 - Academic Regulations R16

B.Tech R15 - Academic Regulations R15

B.Tech R13 - Academic Regulations R13

Academic Year-wise Regulations:

2024-25 - KR24, KR23, KR21, KR21

2023-24 - KR23, KR21, KR21, KR20

2022-23 - KR21, KR21, KR20, R18

2021-22 - KR21, KR20, R18, R18

2020-21 - KR20, R18, R18, R16

2019-20 - R18, R18, R16, R16

2018-19 - R18, R16, R16, R15

2017-18 - R16, R16, R15, R13"
    },
    {
        "id": 6,
        "text": "ECET Last Rank Year College: Keshav Memorial Institute of Technology, Narayanaguda, Hyderabad. Closing ranks of all branches from the 2024-2025 admitted batch:

Course | OC | BCA | BCB | BCC | BCD | BCE | SC | ST | EWS | Girls | Boys | Girls | Boys | Girls | Boys | Girls | Boys ECET 2024 CSE | Nil | Nil | 382 | 456 | 321 | 315 | Nil | Nil | 268 | 261 | 1593 | 229 | 1221 | 1103 | 2185 | 1591 | 416 | 300"
    },
    {
        "id": 7,
        "text": "KMIT TV: 500 hours of recorded content ranging from academic to industry-related courses is available for usage on KMIT TV. Students can listen to any session any number of times until they are confident about that concept. It has videos of live classroom lectures. One can learn from subject matter experts. What’s more, it is free and has unlimited access."
    },
    {
        "id": 8,
        "text": "Events: CSD 2024-25, 2023-24, 2022-23, 2021-22. S. No | Dates | Event Title | Speaker Name | Organized By

27/11/2024 - A guest lecture on deep learning techniques in speech processing applications | Prof. K. Sreenivasa Rao | CSE Department"
    },
    {
        "id": 9,
        "text": "Syllabus: I Year KR24 Regulations - I Year admitted batch 2024-25: CSE, CSM KR23 Regulations - I Year admitted batch 2023-24 KR21 Regulations - I Year admitted batch 2022-23 KR20 Regulations - I Year JNTUH syllabus admitted batch 2020-21 R18 - I Year admitted batches 2018-19, 2019-20 R16 - I Year admitted batch 2016-17, 2017-18"
    },
    {
        "id": 10,
        "text": "Student Achievements: HS Co-curriculars & Extra-curriculars 2023-24, 2020-21, 2019-20, 2018-19. S. No | Name of the Student | Course Name | Section | Certificate Type | Organization | Timeline

Hemasree Guddianti | Problem Solving Through Programming | C, CSM | Online Certification | NPTEL | Jul-Aug 2024

Hemasree Guddianti | Python for Problem Solving | CSM | Online Certification | Codechef | Jul-Aug 2024

Hemasree Guddianti | Learn Python | CSM | Online Certification | Codechef | Jul-Aug 2024

MNK Sai Varun | Foundational C | CSM | Online Certification | Freecodecamp | Jul-Aug 2024

MNK Sai Varun | AI for Business | CSM | Online Certification | LinkedIn | Jul-Aug 2024

MNK Sai Varun | Learn Python | CSM | Online Certification | Codechef | Jul-Oct 2024

PVishwamber | C Programming | CSM | Online Certification | Udemy | Jul-Aug 2024

Leela Sudharshan | Build Your Own Statistic Website | CSM | Online Certification | Nxtwave | Jul-Aug 2024"
    },
    {
        "id": 11,
        "text": "Contact Us: Timings are from 9:30 AM to 4:00 PM, only on working days.

Faculty Details:

Name: Mr. Kanil
Designation: Assistant Professor
Role: HOD
Email ID: hod@kmit.in"
    },
    {
        "id": 12,
        "text": " Women's Day Celebration at KMIT: Keshav Memorial Institute of Technology (KMIT) actively celebrates International Women's Day on March 8th each year, honoring the achievements and contributions of women. In 2025, the National Service Scheme (NSS) unit at KMIT organized a special event to commemorate this day. The celebration featured heartfelt wishes and activities aimed at empowering and recognizing women. Additionally, the NSS unit has been involved in organizing walkathons to celebrate Women's Day, where participants walk together in sarees, symbolizing unity and support for women's rights.

Republic Day Celebration: On January 26th, 2025, KMIT celebrated Republic Day with a series of events that highlighted the institution's patriotic spirit and cultural diversity. The day’s festivities began with the ceremonial hoisting of the national flag, attended by faculty, staff, and students, symbolizing unity and national pride. The cultural program featured a dynamic dance performance by Mudra, KMIT’s dance club. The celebrations were well-attended by all, fostering a sense of patriotism and unity.

Patang Utsav 2025: KMIT celebrates the vibrant festival of Sankranti with its annual event, Patang Utsav, which brings together students, faculty, and alumni to enjoy kite flying, traditional music, dance, and various cultural activities. The 2025 Patang Utsav was held on January 12th, featuring colorful kites, lively music, and enthusiastic participation from the KMIT community. The event was marked by vibrant colors on the ground, music in the air, and kites flying high.

Navraas 2024: KMIT enthusiastically celebrates Dandiya Night, a traditional dance and music event. This celebration is a highlight of the institute’s cultural calendar and fosters community spirit. The 2024 Dandiya Night captured the vibrant atmosphere and joyful participation of students and faculty.

Bathukamma Celebrations: KMIT actively celebrates Bathukamma, the vibrant floral festival of Telangana. The celebrations, organized by the NSS unit of KMIT in collaboration with the Keshav Smarak Shiksha Samiti, featured traditional songs, dances, and the arrangement of Bathukamma floral stacks, reflecting the rich cultural heritage of the region.

Teachers' Day Celebration: KMIT celebrates Teachers' Day on September 5th each year, honoring the contributions of educators. In 2024, the Department of Humanities and Sciences organized a series of events, including guest lectures, engaging talks by distinguished speakers, poster presentations, and quizzes to commemorate the occasion.

Independence Day Celebration: KMIT celebrates Independence Day on August 15th each year with various events and activities. The day is marked by hoisting the national flag, followed by patriotic songs and speeches, fostering a sense of patriotism. The institute typically organizes cultural performances, sports events, and other activities to celebrate India’s independence.

Nexus 24: Nexus 24 was a prominent cultural and technical fest organized by KMIT in 2024. The event spanned multiple days and featured a diverse array of activities, including dance performances, drama presentations, musical events, and technical competitions. The NSS unit of KMIT also participated by setting up a food stall on the first day."
    },
    {
        "id": 13,
        "text": "Consultancy Projects - Crime Free Bharat: The Crime Free Bharat mission, an MP Police initiative, is focused on creating holistic and comprehensive solutions to create a crime-free Bharat, with a focus on internet protocols, cybercrimes, cyber forensics, investigation, and cybersecurity. KMIT and NGIT signed an MoU to work together on this initiative. The projects included e-payment services, smart investigation apps, evidence requisition systems, and more, with real-time encryption and blockchain technology.

Students Involved in the Program:

Mr. A. Sriram Reddy (KMIT)

Mr. Vivek Rupender Gopu (KMIT)

Mr. Kathuroju Harsha Vardhan (KMIT)

Mr. Telukunta Vijay Abhinav (KMIT)

Ms. Sweta Vooda (KMIT)

Mr. P. Sai Varshith (KMIT)

Mr. Manda Hrithik (KMIT)

Mr. Vegi Shanmukh Chowdary (KMIT)

Mr. Vaasrith (KMIT)

Mr. Krishna Deep Yerramallu (KMIT)

Mr. Abhishek Dhatrika (KMIT)

Mr. Sai Venkat Arjun Pathy (KMIT)

Mr. Trishool Parvataneni (KMIT)

Mr. Rithish Murki (KMIT)

Mr. Mithilesh Kumar Devaki (KMIT)

Mr. Pranay (KMIT)

Mr. Shubham Jain (KMIT)

Ms. Namira (KMIT)

Mr. Murki Sai Srikanth (KMIT)

Mr. Syed Zeeshan Abbas Jafferi (NGIT)

Mr. Ayush Modi (NGIT)

Mr. Jammula Dinesh Reddy (NGIT)

Mr. Bheemreddy Soumya Reddy (NGIT)"
    },
    {
        "id": 14,
        "text": "Management - Shri L. Narasimha Reddy: Shri L. Narasimha Reddy, born on August 1, 1953, is the Chief Justice of the Patna High Court and was the senior-most judge at the Hyderabad High Court. Narasimha Reddy hails from an agricultural family in Gavicharla village, Warangal, Telangana. He received his B.Sc. degree from CKM College, Warangal, and later earned both his bachelor's and master's degrees in law, specializing in international law, from Osmania University, Hyderabad."
    },
    {
        "id": 15,
        "text": "About Data Science: The goal of the Data Science course at KMIT is to impart knowledge on techniques and theories related to data science, including statistics, data mining, data warehousing, and data visualization. KMIT offers a four-year B.Tech course in Data Science, which is one of the most promising and in-demand career paths in today's world of big data. The program aims to train students in various technical solutions, including machine learning, artificial intelligence, deep learning, and more, to make them industry-ready and capable of contributing to societal needs."
    },
    {
        "id": 16,
        "text": "Student Achievements, Co-Curriculars, and Extra-Curriculars (2022-23)
Co-Curricular Achievements:
Sujith Geddam – Participated in a Data Science workshop by Penchco and Elannvision at IIT Hyderabad (2 days). Received a certificate of participation.

Karumuri Jayasheela – Participated in Innov8 Hackathon at KMIT Recurse and earned a certificate of appreciation.

Pochampally Shritha – Completed the NPTEL course on Python for Data Science and received an elite course completion certificate.

Manaswi – Completed the NPTEL Python for Data Science elite course and received a certificate.

Manaswi – Participated in KMIT's internal hackathon Kavach 2023 and received a certificate of participation.

Laxminarayana Vibavidya – Completed a web development course (HTML and CSS) along with a project and received a certificate with a grade.

K. Sainath – Received an employment offer as an Associate Software Engineer at Omnicloud Software Consulting Pvt. Ltd.

Arshiya Anjum – Interned with Safertek IT Solutions Pvt. Ltd.

Vaishnavi – Completed NPTEL courses on Python for Data Science (elite), Machine Learning (elite), and Cloud Computing, earning certificates.

Dakshayini – Completed NPTEL Python for Data Science elite course and received a certificate.

Praneeth – Gained admission to IIT Madras' Data Science and Applications foundation level (BS).

G. Vamsi Krishna – Gained admission to IIT Madras' Data Science and Applications foundation level (BS).

Pooja Prajapathi – Completed the NPTEL course on Programming in Java (elite) and received a certificate."


    {
        "id": 17,
        "text": "Biomedical Imaging and Informatics
Digital medical imaging is rapidly advancing, offering practitioners in various medical fields—such as radiology, pathology, and ophthalmology—innovative algorithms to enhance their workflow. Bioinformatics, a key interdisciplinary field, develops software and methods for understanding large and complex biological datasets using statistical and mathematical techniques. It plays a crucial role in analyzing biological queries and managing vast amounts of biological data.

Similarly, Computational Fluid Dynamics (CFD) is increasingly applied in the development of advanced tactical missiles, supporting the need for higher speed, greater maneuverability, and the ability to complete multiple missions.

The Internet of Things (IoT) has seamlessly integrated into our daily lives. With over 50 billion interconnected devices, it is transforming sectors such as agriculture, security, and industrial applications."
    },
    {
        "id": 18,
        "text": "Publications & Projects (2022-23)
International Information and Engineering Technology Association (IIETA) – Dr. Ch. Rathan Kumar published an article titled “A Novel Unsupervised Clustering Algorithm for Identification of Group Spam Reviewers” in volume 27, issue 6, 2022 (ISSN: 1019-1027).

IIETA – Dr. Ch. Rathan Kumar published another article on “Online Transaction Fraud Detection Using Efficient Dimensionality Reduction and Machine Learning Techniques” in volume 36, issue 4, 2022 (ISSN: 621-628).

Mathematical Statistician and Engineering Applications – Dr. Ch. Rathan Kumar published “CGHC Candidates Grouping and Hierarchical Clustering-Based Group Shilling Attacks Detection in Recommender Systems” in volume 71, issue 4, 2022 (ISSN: 2094-0343).

International Journal for Research in Engineering Application Management (IJREAM) – Ms. Afreen Fatima published “A Comprehensive Survey on Security Approaches for Healthcare Data in IoT” in volume 07, issue 10, 2022 (ISSN: 2454-9150)."
    },
    {
        "id": 19,
        "text": "Department of Computer Science and Engineering (CSE)
The Department of CSE at KMIT, established in 2007, began with an intake of 60 students. It has progressively increased its intake to 420 students by 2014. The department is equipped with highly experienced faculty members and state-of-the-art facilities that support research and skill development in emerging technologies. Industry interaction is actively promoted to bridge the gap between academic learning and professional expectations.

The department has collaborations with reputed organizations, allowing students to engage in real-world projects and enhancing their technical skills. Students have consistently secured placements in top global software companies such as Amazon, Microsoft, Google, and Adobe. The department also plans to introduce master's and doctoral research programs to further its academic excellence.

Vision:
To be a premier teaching and research department producing globally competent and socially responsible graduates.

Mission:
To provide faculty with continuous professional development opportunities, transform students into industry-ready professionals, and engage in collaborative research with academia and industry."
    },
    {
        "id": 20,
        "text": "Laboratories
The Humanities and Sciences Department is equipped with state-of-the-art laboratories that cater to diverse fields of study. These labs include:

Applied Physics Lab: Focuses on enhancing scientific temper through hands-on experiments and theoretical learning. Each experiment is supported by a comprehensive demonstration.

Engineering Chemistry Lab: Offers practical training in chemistry with an array of equipment, including UV chambers, digital conductivity meters, and distillation units. It also includes separate balance rooms and chemical storage areas.

English Language Communication Skills (ELCS) Lab: Helps students develop language skills necessary for both professional and personal communication.

Engineering Drawing Lab: Teaches students technical drawing skills used for constructing detailed component specifications.

Engineering Workshop Lab: Provides training in machine shop work, metal work, welding, carpentry, and other areas essential for hands-on engineering learning.

Advanced Communication Skills Lab: Prepares students for careers that require effective listening, speaking, and writing in English for both professional and interpersonal communication."
    },
    {
        "id": 21,
        "text": "Faculty (CSE-AIML Department)
Dr. TVGSridevi – Head of Department, PhD

Dr. K. Bhargavi – Assistant Professor, PhD

Dr. Patil Yogita Dattatraya – Associate Professor, PhD

Dr. D. Kishore Babu – Associate Professor, PhD

Dr. Ch. Sita Kameswari – Assistant Professor, PhD

Ms. Masha Jyothi – Assistant Professor, M.Tech, PhD

Ms. J. Kamal Vijetha – Assistant Professor, M.Tech, PhD

Mr. Y. Singaraiah – Assistant Professor, M.Tech, PhD

Mr. T. Venu – Assistant Professor, M.Tech

Mr. M. Srinivas – Assistant Professor, M.Tech

Mr. Thoka Udaya Kumar – Assistant Professor, M.Tech

Mr. B. Pandya Naik – Assistant Professor, M.Tech

Ms. R. Priyanka – Assistant Professor, M.Tech

Mr. M. Naresh – Assistant Professor, M.Tech

Ms. P. Deepika – Assistant Professor, M.Tech

Ms. N. Lakshmi Prasanna – Assistant Professor, M.Tech

Mr. Sai Charavarthy – Assistant Professor, M.Tech

Ms. A. Sri Tulasi – Assistant Professor, M.Tech

Ms. M. Srujna – Assistant Professor, M.Tech

Ms. N. Parimala – Assistant Professor, M.Tech

Mr. S. Chandra Shekar – Assistant Professor, M.Tech

Ms. S. Lavanya – Assistant Professor, M.Tech

Ms. K. Aishwarya – Assistant Professor, M.Tech

Ms. Surabhi Anuradha – Associate Professor, M.Tech

Ms. E. Harismitha – Assistant Professor, M.Tech

Ms. G. Vasantha – Assistant Professor, M.Tech

Ms. J. Anusha – Assistant Professor, M.Tech

Ms. M. Lavanya – Assistant Professor, M.Tech

"
    },
    {
        "id": 22,
        "text": "Syllabus for CSE-AIML (KR24 Regulations)
The syllabus for the CSE-AIML programs is governed by the following regulations, based on the year of admission:

I Year (2024-25): KR24 Regulations

II Year (2023-24): KR23 Regulations

III Year (2022-23): RKR21 Regulations

IV Year (2021-22): KR21 Regulations

Autonomous Batches (2020-21): KR20 Regulations"
    },
    {
        "id": 23,
        "text": "EAPCET Last Rank (2024)
Here are the last ranks for various categories and programs in the 2024 EAPCET exam:

Category	Male (Open)	Male (Close)	Female (Open)	Female (Close)
OC	1700	6591	2450	7153
EWS	3056	6847	4092	7906
BCA	5778	15501	10475	17884
BCB	5056	8478	4102	8741
BCC	9817	17781	29841	29841
BCD	3217	8259	4269	8953
BCE	2968	20592	16499	25890
SC	14437	13989	17388	34828
ST	22729	39433	30519	49293"
    },
    {
        "id": 24,
        "text": "Internal Quality Assurance Cell (IQAC)
The IQAC is responsible for ensuring continuous improvement in the academic and administrative performance of the institution. The committee includes various stakeholders, including students, alumni, faculty, department heads, and experts from industry and the local community. The key objectives of IQAC are to:

Develop a system for consistent action to improve institutional quality.

Periodically assess benchmarks for all courses and programs.

Implement internal quality checks to improve academic standards.

Foster holistic development for students and faculty.

Functions and Strategies of IQAC:

Direct and indirect assessment of benchmarks for courses and subjects.

Enhancement of participatory teaching-learning processes using ICT.

Organize workshops, seminars, and conferences for faculty and students.

Promote industry-institute interaction programs.

Focus on resource mobilization for research, consultancy, and extension activities.

The IQAC ensures effective and progressive performance in academic, administrative, and financial tasks, and promotes modern teaching and learning methods. It also aims to develop a strong quality culture within the institution."
    },
    {
        "id": 25,
        "text": "Co-Curricular Activities: Information about various co-curricular activities at KMIT."
    },
    {
        "id": 26,
        "text": "About the Humanities & Science (HS) Department: Established in 2007, the department offers a current intake of 840 students, with 540 in CSE and 300 in CSM. The department focuses on laying strong foundations in basic sciences and language skills, which are essential for the advanced learning of technology students. The department's mission includes training students in the latest software technologies, fostering a passion for algorithmic thought processes, and encouraging lifelong learning through multi-modal platforms. The program aims to create socially conscious, well-rounded individuals who contribute to India's technological and entrepreneurial growth. Program outcomes include proficiency in engineering knowledge, problem-solving, design, investigation, modern tool usage, ethics, team work, communication, project management, and lifelong learning."
    },
    {
        "id": 27,
        "text": "Library: CSE Library at KMIT offers resources for Computer Science Engineering students."
    },
    {
        "id": 28,
        "text": "Syllabus for CSE (KR24 Regulations) Admitted Batches: 1st Year syllabus for different batches (2024-2025, 2023-2024, 2022-2023, etc.). Specific syllabi available for KR23, KR21, KR20, R18, and R16 batches."
    },
    {
        "id": 29,
        "text": "Contact Us: Timings are from 9:30 AM to 4:00 PM on working days. Faculty contacts: 1. Mr. Balakrishna Ushakoyala, Assistant Professor, HOD, HS (Email: hshod1@kmit.in). 2. Mrs. Saritha Gone, Assistant Professor, HOD, HS (Email: hshod2@kmit.in)."
    },
    {
        "id": 30,
        "text": "Faculty in HS Department: The department has a diverse set of faculty members with expertise in various disciplines such as mathematics, physics, chemistry, English, and mechanical engineering. Notable faculty include: 1. Mr. Balakrishna Ushakoyala, HOD, MSc PhD (Mathematics). 2. Mrs. Saritha Gone, HOD, MBA PhD (Finance). 3. Dr. Padmanabha Sastry, Associate Professor, PhD (Mathematics). 4. Dr. Srinivas Mangipudi, Associate Professor, PhD (Physics). 5. Dr. Siperambudur Udaya Laxmi, Associate Professor, PhD (Physics). 6. Dr. Bhikshu N L, Associate Professor, PhD (Mathematics). 7. Dr. Devika Rubi, Associate Professor, PhD (Mathematics). 8. Dr. Pramada Jayanthi, Associate Professor, PhD (Mathematics). 9. Dr. Seshu Bhamidipati, Associate Professor, PhD (Physics). 10. Dr. K Swapna, Associate Professor, PhD (Chemistry)."
    },
    
    {
        "id": 31,
        "text": "Courses at KMIT: Established in 2007, KMIT is a premier engineering college in Telangana, accredited with 'A' grade by NAAC and by NBA. KMIT is AICTE approved and affiliated with JNTUH. The college offers B.Tech programs in the following fields: 1. B.Tech Computer Science Engineering (CSE): Total intake 540 (162 management seats, 378 convenor seats). 2. B.Tech CSE with Artificial Intelligence & Machine Learning (CSM): Total intake 300 (90 management seats, 210 convenor seats). The AI & ML program was approved by AICTE starting from the 2020-21 academic year."
    },
    {
        "id": 32,
        "text": "Events for CSM 2023-24: 1. Seminar on Generative AI (04/08/2023): Speaker: Mr. Ravi Mandala, Search Engineer at LinkedIn. Organized by the Department of CSE-AI/ML. 2. One-week Generative AI Workshop (06/09/2023 - 14/09/2023): Speakers include Neil Gogte, Mrs. Anuradha Surabhi, Mr. P. Balarama Murthy, Dr. Sridhar Jinka, Mrs. Asha Jyothi, and Mrs. Priyanka Saxena. 3. FDP on AI Applications in NLP & Speech Processing (22/04/2024 - 24/04/2024): Speakers include Dr. Rahul Mishra, Dr. Parameswari Krishnamurty, Dr. Radhika Mamidi, Dr. Anil Kumar Vuppala, Dr. Chiranjeevi, Dr. Dipti from IIITH."
    },
    {
        "id": 33,
        "text": "Syllabus: 1. CSE Syllabus - View. 2. CSM Syllabus - View. 3. CSD Syllabus - View. 4. IT Syllabus - View."
    },
    {
        "id": 34,
        "text": "About the Artificial Intelligence & Machine Learning Program: The 4-year undergraduate B.Tech course in Computer Science Engineering with specialization in AI & ML is designed to build expertise in advanced learning systems based on AI algorithms. The program covers areas such as neural networks, natural language processing, robotics, deep learning, computer vision, and machine learning. The goal is to equip students with skills to develop intelligent solutions for business problems. It emphasizes proficiency in mathematics, strong problem-solving skills, and exposure to emerging technologies. The program aims to produce graduates capable of tackling societal challenges through technology, with a focus on collaborative research and industry partnerships. The course's key objective is to provide students with a solid foundation in AI and ML, preparing them for successful careers in the tech industry."
    },
    {
        "id": 35,
        "text": "National Institutional Ranking Framework (NIRF): Information about KMIT's NIRF rankings."
    },
    {
        "id": 36,
        "text": "Heads of Departments: 1. Dr. Vemula Aruna: CSE HOD. 2. Ms. Rupa Devi: Incharge HOD. 3. Ms. Priyanka Saxena: Incharge HOD. 4. Mr. Para Upendar: Incharge HOD. 5. Dr. G. Narender: IT HOD. 6. Dr. T.V.G. Sridevi: CSE-AI/ML HOD. 7. Mr. Kanil: CSE-Data Science HOD. 8. Ms. Saritha Gone: HS HOD. 9. Dr. Balakrishna Ushakoyala: HS HOD."
    },
    {
        "id": 37,
        "text": "National Board of Accreditation (NBA): Accreditation information for KMIT."
    },
    {
        "id": 38,
        "text": "E-Resources: Course Materials and Lecture Notes for Various Subjects: 1. Dr. J.V.S. Srinivas (Data Structures through C): NPTEL Videos, GeeksforGeeks. 2. Dr. G. Narender (C III): NPTEL. 3. Ms. B. Jyoshna (DS III): CEC. 4. Mr. N. Chander (COA III): NPTEL. 5. Dr. J. Pramada (MFCS III): NPTEL. 6. Ms. B. Prabhavathi (ADE III): NPTEL. 7. Ms. I. Tejaswi (Python Programming III): NPTEL. 8. Mr. T. Charan Singh (Java Programming III/IV): NPTEL. 9. Ms. G. Aparna (Database Management Systems III/IV): NPTEL. 10. Ms. K. Priyanka (Operating Systems III/IV): CEC. 11. Ms. Ch. Madhuri (Automata and Compiler Design III/IV): NPTEL. 12. Dr. G. Mahesh (Probability Theory and Statistics III/IV): CEC. 13. Dr. M. Anuradha (WT III/IV): NPTEL. 14. Mr. P. Vamshi Krishna (CN III/IV): NPTEL. 15. Ms. TV Divya (SE III/IV): CEC. 16. Mr. Mekala Srinivas (FLAT III/IV): NPTEL. 17. Ms. Arshiya Begum (CD III/IV): NPTEL. 18. Ms. B. Varsha (STM III/IV): NPTEL. 19. Ms. J. Kamal Vijetha (ML III/IV): NPTEL. 20. Mr. N. Chander (FIoT III/IV): NPTEL."
    },
    
    {
        "id": 39,
        "text": "Contact Us: Timings from 09:30 AM to 04:00 PM only on working days. 1. Dr. Vemula Aruna: Associate Professor, HOD CSE, Email: hod@cse.kmit.in. 2. Ms. Rupa Devi T: Assistant Professor, HOD Incharge, Email: csehod2@kmit.in. 3. Ms. Priyanka Saxena: Assistant Professor, HOD Incharge, Email: csehod3@kmit.in. 4. Mr. Para Upendar: Assistant Professor, HOD Incharge, Email: csehod4@kmit.in."
    },
    {
        "id": 40,
        "text": "Faculty CSE Data Science: 1. Mr. Kanil Kumar: HOD, M.Tech. 2. Dr. Vishal Reddy: Assistant Professor, Ph.D. 3. Dr. Ch Rathan Kumar: Assistant Professor, Ph.D. 4. Ms. Apavani: Assistant Professor, M.Tech. 5. Ms. Paparna: Assistant Professor, M.Tech. 6. Ms. Ayesha Anjum: Assistant Professor, M.Tech. 7. Mr. A. Ravindar: Assistant Professor, M.Tech. 8. Mr. P. Vamshi Krishna: Assistant Professor, M.Tech. 9. Ms. Padmavathi B: Assistant Professor, M.Tech. 10. Ms. Deekshitha Y: Assistant Professor, M.Tech. 11. Ms. G. Vanaja: Assistant Professor, M.Tech. 12. Ms. G. Swetha: Assistant Professor, M.Tech."
    },
    {
        "id": 41,
        "text": "Autonomous Examination Branch Faculty Staff: 1. Dr. B.L. Malleswari: Principal, Chief Controller of Examinations, Mobile: 9885189917. 2. Dr. S. Udaya Laxmi: Asst. Prof, Controller of Examinations, Mobile: 9949351088. 3. Dr. S.J.S. Antony: Asst. Prof, Addl. Controller of Examinations, Mobile: 9751774188. 4. Mrs. B. Swapna: Asst. Prof, Addl. Controller of Examinations, Mobile: 9849786017. 5. Mr. Sateesh Ravuri: Asst. Prof, Addl. Controller of Examinations, Mobile: 7842409596. 6. Mr. A.N. Sai Chakravarthy: Asst. Prof, Examination Branch Member, Mobile: 8019152919. 7. Mrs. G. Naga Sree Suma: Asst. Prof, Examination Branch Member, Mobile: 7842514399. 8. Mr. K. Rajesh Kumar: Asst. Prof, Examination Branch Member, Mobile: 9392413339. 9. Mr. Shailesh Bhosekar: Asst. Prof, Examination Branch Member, Mobile: 9490682216. 10. Mr. N. Lalitha Manohar: Non-teaching Asst. Admin, Mobile: 9121016889. 11. Mr. C. Naveen Kumar: Non-teaching Asst. Admin, Mobile: 9014846075. 12. Mrs. S. Sunitha: Non-teaching Asst. Admin, Mobile: 9618903337. 13. Mrs. L. Spoorthi Reddy: Non-teaching Asst. Admin, Mobile: 9177275456. 14. Mrs. A. Ravali: Non-teaching Asst. Admin, Mobile: 9154031784."
    },
    {
        "id": 42,
        "text": "Director Academic - Mrs. Deepa Ganu: Mrs. Deepa Ganu is a proactive and student-friendly academic director at KMIT. With a background in B.Tech (ECE) from Pune University and M.Tech from JNTU Hyderabad, she has been instrumental in mentoring students for various national and international platforms like Microsoft Imagine Cup, IBM's Great Mind Challenge, Google Summer of Code, and Amazon Campus Mentorship Series. She has also conducted corporate training for reputed companies like Verizon, HP, and CA Global, as well as government agencies such as DRDL and RCI. Mrs. Ganu is the author of the book 'Java Spoken Tutorials' under IIT Bombay's initiative and has received prestigious titles like 'Best Mentor' and 'Acharya' from major corporate companies. She has also been honored with the Drona Award for her contribution to pedagogy."
    },
    {
        "id": 43,
        "text": "CSE Labs Photos by Traces of Lenses Club: KMIT offers 18 state-of-the-art computer labs for CSE students, equipped with HP and Dell computers and the latest software. Labs are Wi-Fi enabled and air-conditioned, open from 8:30 AM to 6:00 PM. Key labs include: 1. Computer Networks Lab: Focus on TCP/IP and Ethernet/Internet networking. 2. Data Mining Lab: Emphasizes algorithms and patterns in data warehousing and mining. 3. Data Structures Lab: Studies fundamental data structures and their implementation. 4. Java Programming Lab: Teaches object-oriented programming with Java. 5. Operating Systems Lab: Focuses on OS principles and error detection methods. 6. Database Management Systems Lab: Provides formal foundation in database concepts. 7. Software Engineering Lab: Uses Rational Rose for software development life cycle. 8. Web Technologies Lab: Focuses on designing and implementing websites. 9. Machine Learning with Python Lab: Teaches machine learning algorithms using Python. 10. Competitive Programming Lab: Covers algorithms like sliding window, bit manipulation, and more. 11. Cloud Computing Lab: Focuses on AWS cloud architecture and services. 12. Front-end Web Development Lab: Teaches static and dynamic web design. 13. Project Labs: Focus on requirements analysis, design, coding, implementation, and testing of student projects."
    },
    
    {
        "id": 44,
        "text": "Contact Us: Timings from 09:30 AM to 04:00 PM only on working days. 1. Dr. TVG Sridevi: Assistant Professor, HOD AIML, Email: hodaiml@kmit.in"
    },
    {
        "id": 45,
        "text": "Academic Core Committee: Key functions include subject allocation based on faculty expertise, encouragement for faculty to attend refresher courses, performing gap analysis, and devising strategies for course delivery. Feedback from students is continuously monitored and used for corrective measures. The committee ensures compliance with the university curriculum and attainment of Program Outcomes (POs) and Program Specific Outcomes (PSOs). Members for the academic year 2023-24: 1. Dr. BL Malleswari, Principal, KMIT, Chairperson. 2. Dr. K. Bhargavi, CSE AIML, Convenor. 3. Dr. S. Udaya Lakshmi, COE, Member. 4. Mr. G. Rakesh Reddy, CSE, Member. 5. Mr. A.L. Narasimha Rao, HS, Member. 6. Ms. M. Saradamani, HS, Member. 7. Dr. M. Anuradha, CSE, Member. 8. Dr. Vishal Reddy, CSE DS, Member."
    },
    {
        "id": 46,
        "text": "Value Added Services: All addon programs under the Finishing School, Trishul, and SONET School of New and Emerging Technologies are provided free of cost to students. Selection for various programs is based on performance in written tests and the previous academic year. Bridge courses like basic communication skills, scratch programming, and vocational training are compulsory for all first-year students. Additionally, coaching for Cambridge English's Business English Certificates is provided free of cost on a first-come, first-serve basis. Faculty with expertise in these areas teach the courses, and CPD (Continued Professional Development) is provided to ensure faculty stay up to date. SONET, Finishing School Project, and School Imagineering School are part of this initiative."
    },
    {
        "id": 47,
        "text": "Learning Management System: 1. Sanjaya: An Android app for parents to track attendance, timetable, performance, events, results, and discipline ratings. Features include live classroom access and direct communication with KMIT. 2. Drona: An Android app for teaching faculty to mark attendance, track timetables, add disciplinary points, and receive notifications. 3. Netra: An Android app for students to track attendance, timetable, performance, events, and results, with access to technical and general videos and notifications on class cancellations."
    },
    {
        "id": 48,
        "text": "Interactive Classroom Teaching: KMIT employs a modern approach with smart classrooms, use of technology like projectors, screens, and interactive boards for dynamic multimedia content. Learning Management Systems (LMS) like Tesseract, KMIT Vista, and others are used to share resources and engage students. Active learning methods such as case studies, problem-based learning, and flipped classrooms enhance learning. Industry collaborations, guest lectures, workshops, and hands-on practice labs are encouraged. The Audiovisual Centre at KMIT supports the creation of high-definition educational content for e-learning."
    },
    {
        "id": 49,
        "text": "Academic Reports, E-resources, Course Materials, and Lecture Notes"
    },
    
    {
        "id": 50,
        "text": "Faculty Achievements CSD (2023-24, 2022-23): 1. Dr. Chrathan Kumar: Awarded PhD from OU. NPTEL Domain Certification, NPTEL Discipline Star. Organization: Osmania University, NPTEL. 2. Dr. Vishal Reddy: 1A Framework for Opinion Extraction and Analysis, ICTIS 2023 Vol 720, Springer Singapore. Publication: Springer. 3. Dr. Vishal Reddy: Deep Learning Approach towards Emotion Recognition Based on Speech, Proceedings of the 3rd International Conference on ICkE 2023. Event: Virstusa Training, BigData, IFSAWS PS, Mentor, KMIT. 4. Ms. Afreen Fathima Mohammed: Introduction to Computer Science Using Python (A Problem Solving Focus). Publication: Alpha International Publications, Springer. 5. Mr. P. Vamshi Krishna: PhD in Knowledge-Based System Using AI and Ontology for Sentiment Analysis of Railways Tweets. Workshop/FDP Participation."
    },
    {
        "id": 51,
        "text": "Faculty CSE: 1. Dr. Varuna: HOD, PhD 2. Ms. Rupa Devi T: Incharge HOD, II Year, MTech, PhD 3. Ms. Priyanka Saxena: Incharge HOD, III Year, MTech, PhD 4. Mr. Para Upendar: Incharge HOD, IV Year, MTech, PhD 5. Dr. J.V.S. Srinivas: Professor, PhD 6. Mr. Ashok Sharma: Professor, MTech 7. Dr. Antony SJS: Associate Professor, PhD 8. Dr. Sunil Kumar Thota: Associate Professor, PhD 9. Dr. M. Anuradha: Associate Professor, PhD 10. Dr. Juhi Juwairiyyah: Associate Professor, PhD 11. Mr. Maringanti Seshu Kumar: Associate Professor, MTech 12. Ms. Deepa Ganu: Assistant Professor, MTech 13. Dr. Patwari Prasad Rao: Assistant Professor, PhD 14. Ms. Khushi M. Asudaria: Assistant Professor, MTech 15. Ms. M. Komala: Assistant Professor, MTech 16. Mr. Bhukya Srinu: Assistant Professor, MTech, PhD 17. Mr. Gnanesh Aggadi: Assistant Professor, MTech 18. Ms. Srija: Assistant Professor, MTech 19. Mr. Madduri Narsimlu: Assistant Professor, MTech, PhD 20. Mr. Alk Bilahari: Assistant Professor, MTech, PhD 21. Mr. Appireddy V. Nagireddy: Assistant Professor, MTech, PhD 22. Ms. Swapna Bandari: Assistant Professor, MTech, PhD 23. Ms. Prabhavathi Devi: Assistant Professor, MTech 24. Mr. G. Krishna Subramanyam: Assistant Professor, MTech, PhD 25. Mr. Satyanarayana Bukka: Assistant Professor, MTech, PhD 26. Ms. Naga Sree Suma Geddam: Assistant Professor, MTech 27. Mr. Karanji Rajesh Kumar: Assistant Professor, MTech 28. Mr. Challa Sundeep Babu: Assistant Professor, MTech, PhD 29. Ms. Arshiya Begum: Assistant Professor, MTech 30. Ms. S. Archana Reddy: Assistant Professor, MTech, PhD 31. Ms. K. Jamuna Rani: Assistant Professor, MTech 32. Mr. B. Madhukar: Assistant Professor, MTech 33. Mr. T. Charan Singh: Assistant Professor, MTech, PhD 34. Mr. M. Shankar: Assistant Professor, MTech, PhD 35. Mr. Kiran Kumar M: Assistant Professor, MTech 36. Ms. Haleema Bushra: Assistant Professor, MTech 37. Mr. G. Suresh: Assistant Professor, MTech 38. Ms. Madhurika Budaraju: Assistant Professor, MTech, PhD 39. Ms. Nasreen Sultana: Assistant Professor, MTech 40. Ms. Athar Fatima: Assistant Professor, MTech 41. Ms. K. Priyanka: Assistant Professor, MTech 42. Ms. B. Arti: Assistant Professor, MTech 43. Ms. Yasaswini: Assistant Professor, MTech 44. Mr. Bhanu Mahesh: Assistant Professor, MTech 45. Mr. Narendra Ravula: Assistant Professor, MTech 46. Ms. Shruthi K: Assistant Professor, MTech 47. Mr. Shailesh: Assistant Professor, MTech, PhD 48. Dr. Sesha Charyulu: Assistant Professor, PhD 49. Mr. P. Kiran Kumar: Assistant Professor, MTech 50. Ms. A. Gowthami: Assistant Professor, MTech 51. Ms. Spoorthy C. Hundekar: Assistant Professor, MTech 52. Mr. E. Srinath: Assistant Professor, MTech 53. Ms. Supriya Kasetty: Assistant Professor, MTech 54. Ms. T. N. Sriranjani: Assistant Professor, MTech 55. Ms. V. Anusha: Assistant Professor, MTech 56. Ms. Ch. Rajeswari: Assistant Professor, MTech 57. Mr. Aditya Kumar T: Assistant Professor, MTech 58. Ms. Mallika P: Assistant Professor, MTech 59. Ms. Padmapriya T: Assistant Professor, MTech 60. Mr. Subba Rao P: Assistant Professor, MTech 61. Ms. Minakshee Sonwane: Assistant Professor, MTech 62. Ms. Arigela Jyothi: Assistant Professor, MTech 63. Ms. G. Vasantha: Assistant Professor, MTech 64. Ms. P. Harika: Assistant Professor, MTech 65. Ms. K. Prathyusha Reddy: Assistant Professor, MTech 66. Ms. P. Sireesha: Assistant Professor, MTech 67. Ms. Uzma Khatoon: Assistant Professor, MTech 68. Ms. Sanjana Gogte: Assistant Professor, MTech 69. Ms. Ratnamala: Assistant Professor, MTech 70. Ms. Mahi Soudamini: Urgent Faculty Wellness Coach"
    },
    {
        "id": 52,
        "text": "ATAL Ranking of Institutions on Innovation Achievements"
    },
    {
        "id": 53,
        "text": "Teleuniv: Teleuniv is a technological platform designed to replace traditional methods of teaching with an engaging, immersive, and interactive digital experience. Its vision is to reduce the productivity and employability skills gap in India through dynamic digital learning. The mission of Teleuniv is to create innovative, differentiating factors for an inclusive learning experience. It features live cloud-based labs providing instant assessments and focuses on content depth and practical work to improve traditional education methods."
    },
    {
        "id": 54,
        "text": "Syllabus (CSE Data Science): KR23 Regulations: Admitted Batch 2023-24: I Year Syllabus: I & II Sem II Year Syllabus: I & II Sem RKR21 Regulations: Admitted Batch 2022-23 KR21 Regulations: Admitted Batch 2021-22 KR20 Regulation (Autonomous): Admitted Batch 2020-21"
    },
    
    {
        "id": 55,
        "text": "Other Committees:

**Grievance Redressal Committee:** A Grievance Redressal Committee was instituted in accordance with the guidelines outlined by AICTES and UGC. Its objectives are to cultivate an approachable and accountable atmosphere among all stakeholders, creating a congenial, hospitable, sociable, serene, and harmonious educational environment in the institute. The committee strives to prevent grievances and maintain a frictionless, amicable relationship among stakeholders. It aims to express grievances fearlessly and build confidence in the GRC of the institution, particularly among the student community, thus striving for a completely ragging-free environment. Complaint boxes, which are free from CCTV coverage, are placed at different locations on the campus to allow for anonymous complaints.

**Committee Members:**
1. Dr. B.L. Malleswari - Chairperson  
2. Dr. T.V.G. Sridevi - Convener  
3. Dr. S. Naga Sarada - Member  
4. Ms. Sharmeela Chungi - Member  
5. Ms. Sharadamani - Member  
6. Mr. Giri Babu - Member  

Other Committees:  
- Anti-Ragging Committee  
- Discipline Committee  
- Faculty Welfare Committee  
- Maintenance Committee  
- Student Counselling Committee  
- NSS Committee  
- SC/ST Welfare Committee  
- Women Empowerment Committee  
- Anti-Sexual Harassment Committee  
- Professional Bodies Activities Committees  
- Publications Committee  
- Research and Development Committee  
- Entrepreneur Development Committee  
- Results Analysis Committee  
- Self-Learning Committee  
- Course File Committee  
- Feedback Committee  
- Lab Maintenance Committee  
- Training and Placement Committee  
- Alumni Committee  
- Library Committee  
- Sports Committee  
- Arts and Cultural Committee  
- Purchase and Stores Committee  
- College Maintenance Committee  
- Unnat Bharat Abhiyan (UBA) Committee  
- Women Protection Cell  
- Internal Complaint Committee  
- Social Welfare Committee"
    },
    {
        "id": 56,
        "text": "Endowment Awards 2024, Endowment Awards 2023, Endowment Awards 2022, Endowment Awards 2021, Endowment Awards 2020, Endowment Awards 2019, Endowment Awards 2018, Endowment Awards 2017"
    },
    {
        "id": 57,
        "text": "Sponsored Research: BIRAC Auto Education Tools & Other Research Projects

We have been involved in the development of a Clinical Translational Research CAD (Computer-Aided Disease Detection) Diagnostic System for various cancers. This AI-powered end-to-end clinical diagnostics workflow is aligned with the College of American Pathologists (CAP) protocol and includes biomedical imaging, pathology, radiology, and biomarker identification, initially focusing on breast cancer. The project has been awarded INR 50 lakhs (BIRACIKP01207BIG1620) by BIRAC (Biotechnology Industry Research Assistance Council), Department of Biotechnology, Government of India. Dr. Rohit Tapadia from Tapadia Diagnostics Center, Hyderabad, is providing clinical protocol guidance and validating the entire product development. We are also collaborating with several cancer hospitals across the region. The team working on the BIRAC project is the same as the one working on biomedical imaging.

BIRAC Team:
S.No | Faculty Name

Dr. S. Rajasekaran - Principal Investigator

Dr. Rohit Tapadia

Dr. R. Devika Rubi

Prof. Vinay Patankar

Student Members:
S.No | Roll No | Student Name

17BD1A050T | Mr. Kanneganti Sai Rohith

17BD1A051A | Mr. Pingali Raghavendra Suraj

17BD1A051E | Mr. Priyal Jain

17BD1A057Q | Ms. Swathi Gupta

17BD1A050U | Mr. Kasavaraju Abhay Krishna

17BD1A050Q | Mr. Kala Samyak Jain

17BD1A051N | Ms. Sri Laxmi Sai Sahithi Dendukuru

17BD1A0432 | Mr. Kota Ruchik

18BD1A0561 | Mr. A. Sai Vijaya Bhargavi

18BD1A050P | Mr. Kathoroju Harsha Vardhan

18BD1A051A | Mr. Telukunta Vijay Abhinav

18BD1A055E | Mr. Srinivas Yadav

18BD1A051N | Mr. Vivek Rupender Gopu

18BD1A051W | Mr. Yerramallu M.S.S. Krishna Deep"
    },
    {
        "id": 58,
        "text": "Events CSE 2023-24, 2022-23, 2021-22, 2020-21, 2019-20, 2018-19, 2017-18, 2016-17, 2015-16: 

1. Date: 15/07/2023 - Event Title: A Seminar on Mastering the Art of Research Paper Publications: Strategies for Success. Speaker: Dr. Padmalaya Nayak, Professor of CSEIT, Gokaraju Lailavathi Women's Engineering College, Hyderabad. Organized by: CSE.
  
2. Date: 13/07/2023 - Event Title: A Webinar on Intellectual Property Rights (IPR) - Patent Designs Filing. Speaker: Dr. Bharat N. Suryawanshi, Assistant Controller of Patents and Designs, Ministry of Commerce & Industry, Government of India. Organized by: Department of Computer Science and Engineering in association with RGNIIPM, Govt. of India."
    },
    {
        "id": 59,
        "text": "Admissions to the B.Tech program are conducted through a common entrance test, EAPCET, organized by the Government of Telangana. The eligibility for admission to the first year of the B.Tech course requires a pass in the Intermediate (10+2) exam conducted by the Board of Intermediate Education, Telangana, or any equivalent exam with Mathematics, Physics, and Chemistry as optional subjects. The admission pattern is as follows: 70% of the seats are allotted based on merit in EAPCET, while 30% of the seats are reserved for management/NRI candidates. Additionally, diploma holders are admitted into the second year of B.Tech under the lateral entry scheme, with up to 20% of the intake based on merit in ECET. The fee structure for the 2024-2025 academic year is as follows: for the first year, the tuition fee is 103,000, special fee 5,500, and NBA fee 3,000; for the second year, the tuition fee is 103,000, special fee 2,500, and NBA fee 3,000; for the third year, the tuition fee is 103,000, special fee 2,500, and NBA fee 3,000; and for the fourth year, the tuition fee is 103,000, special fee 2,500, and NBA fee 3,000. For more information, please contact the admissions department at 6302140205."
    },
    {
        "id": 60,
        "text": "Teaching, Learning, and Evaluation
Teaching and Learning Process: Focuses on the effective implementation of course outcomes, ensuring a robust teaching-learning environment.

Evaluation and Attainments: The process involves continuous assessment and ensuring students achieve desired course outcomes."
    },
    {
        "id": 61,
        "text": "Research and Innovation
Research Labs & Centers of Excellence: The institution houses state-of-the-art research labs and promotes excellence through sponsored research and consultancy projects.

Workshops & Innovation Council: Research workshops and activities are organized regularly to encourage innovation. The institution is actively involved in the Institution Innovation Council (IIC) and initiatives like Google Summer of Code (GSoC)."
    },
    {
        "id": 62,
        "text": "Faculty Achievements (CSE Department)
2023-2024 to 2014-2015
Dr. V. Aruna – Textbook on Introduction to Operating Systems, BlueRose Publishers.

Dr. S. Padmaja – Reviewer at the International Conference on Emerging Trends in Engineering, University College of Engineering, Osmania University.

P. Niranjan Kumar – NPTEL Course on Introduction to Parallel Programming with OpenMP and MPI.

Dr. V. Aruna – Judge for Paper Presentation Contest, ATRI.

Dr. Ch. Rathan Kumar – NPTEL Domain Certification in Data Science.

Dr. Ch. Rathan Kumar – NPTEL Discipline Star.

Dr. Ajeeth Jain – Guest Lecture on Transfer Learning in Deep Learning Projects, Xavier Institute of Engineering, Mumbai.

Dr. Ajeeth Jain – Guest Lecture on Emerging New Technologies, CVR College of Engineering."
    },
    {
        "id": 63,
        "text": "NSS Events & Contact Information
Faculty Contact
Dr. K. Swapna

Designation: Assistant Professor

Contact Number: 9989632167

Recent NSS Events
S.No.	Event Name	Date	Faculty Participants	Student Participants
1	Blood Donation Campaign	02/21/2025	11	177
2	Blood Donation Campaign	03/16/2024	2	83
3	Sanitary Pads Distribution to Men	01/21/2024	0	15
4	Essay Competition	11/10/2023	0	36
5	Shubharambh	11/10/2023	5	34
6	Rashtriya Ektha Diwas Pledge	10/31/2023	9	110
7	Waves Without Waste	10/29/2023	0	10
8	Blood Donation Campaign	10/25/2023	9	110
9	Cloth Donation Campaign	10/11/2023	1	40
10	Rakhi for Rakshak	09/01/2023	1	34
11	Mission Arivu (Book Donation Drive)	06/19/2023	0	26
12	Feel the Pain	08/25/2022	0	15
13	Badminton Tournament	06/11/2022	0	49
14	Interview Readiness	07/16/2021	0	42
15	Blood Donation Camp	11/29/2021	9	48"
    },
    {
        "id": 64,
        "text": "Academic Information
Programs Offered
B.Tech Programs:

Computer Science Engineering (CSE)

Artificial Intelligence & Machine Learning (CSE-AIML)

Data Science (CSE-DS)

Information Technology (IT)

Key Information
Vision & Mission: The institution aims to provide quality education and foster an environment that promotes research, innovation, and professional growth.

NAAC & IQAC: The institute adheres to NAAC standards and strives to maintain quality through its Internal Quality Assurance Cell (IQAC).

Industry Interaction: The Industry Interaction Cell (IIC) promotes collaboration between academia and industry, ensuring that students are well-prepared for the professional world.

Quick Links:
Placements

Student Activities

Gallery

Student Learning Center

Faculty Leave Application

Examination

Swayam Corner

Research

Other Committees

"
    },
    {
        "id": 65,
        "text": "Academic Calendars
The academic calendar for various batches includes detailed schedules for semesters based on the KR24, KR23, RKR21, and other regulations for the years 2024-2025 through 2016-2017. Contact college for more details."
    },
    {
        "id": 66,
        "text": "Contact Information
Address:
351026, Narayanaguda, Hyderabad 500029, Telangana, India.
Phone: 040-23261407
Email: info@kmit.in
Grievance Redressal: Available online.

Examination Branch
Timings: 9:30 AM to 4:00 PM (on working days)

Autonomous: 919391614325 | Email: autonomousams@gmail.com

Non-Autonomous: 040-23261407 | Email: exams@kmit.in"
    }
]